In [9]:
import pandas as pd

In [12]:
mydict = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['one', 'two', 'three', 'four']}

In [14]:
df = pd.DataFrame(mydict)

In [16]:
df

   col1  col2   col3
0     1     5    one
1     2     6    two
2     3     7  three
3     4     8   four

In [20]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df.col1

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [30]:
df[['col1', 'col2']]

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [32]:
df.loc[:, ['col1','col3']]

   col1   col3
0     1    one
1     2    two
2     3  three
3     4   four

In [45]:
df[df.'col1'>2] 
# df[df['col1']>2]

SyntaxError: invalid syntax (784885169.py, line 1)

In [50]:
df[(df.col1>2) & (df.col2==7)]

   col1  col2   col3
2     3     7  three

In [58]:
df[(df.col1<=2) & (df.col2!=7)]['col3']

0    one
1    two
Name: col3, dtype: object

In [62]:
df[(df.col1<=2) & (df.col2!=7)][['col3', 'col1']]

  col3  col1
0  one     1
1  two     2

In [64]:
df

   col1  col2   col3
0     1     5    one
1     2     6    two
2     3     7  three
3     4     8   four

In [70]:
df.loc[1:3]

   col1  col2   col3
1     2     6    two
2     3     7  three
3     4     8   four

In [72]:
df.iloc[1:3]

   col1  col2   col3
1     2     6    two
2     3     7  three

In [76]:
df.loc[2:0]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [78]:
df.loc[2:0:-1]

   col1  col2   col3
2     3     7  three
1     2     6    two
0     1     5    one

In [82]:
df.loc[2:0:-1, ['col3', 'col1']]

    col3  col1
2  three     3
1    two     2
0    one     1

In [84]:
# retrieve col3 and col1 where col2>7
df.loc[1:0]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [86]:
df.loc[1:0:-2]

   col1  col2 col3
1     2     6  two

In [92]:
df.loc[df.col2<7][['col3', 'col1']]

  col3  col1
0  one     1
1  two     2

In [90]:
df.query('col1>2')

   col1  col2   col3
2     3     7  three
3     4     8   four

In [94]:
# retrieve row where 2times col1 values will >= col2 value
df.query('2*col1>=col2')

   col1  col2  col3
3     4     8  four

In [96]:
df

   col1  col2   col3
0     1     5    one
1     2     6    two
2     3     7  three
3     4     8   four

In [98]:
df.query("col3 in ['one', 'three']")

   col1  col2   col3
0     1     5    one
2     3     7  three

In [100]:
df.query("col3 not in ['one', 'three']")

   col1  col2  col3
1     2     6   two
3     4     8  four

In [110]:
df.query("col2 not in [5,7]")

   col1  col2  col3
1     2     6   two
3     4     8  four

In [112]:
df.query('col2 != [5,7]')

   col1  col2  col3
1     2     6   two
3     4     8  four

In [114]:
#working with columns

       0         1
0   1001    nagesh
1   1002  lakshami
2  10303    ganesh
3   1004      anil

ValueError: Length mismatch: Expected axis has 3 elements, new values have 2 elements

       0         1   dept
0   1001    nagesh  sales
1   1002  lakshami  sales
2  10303    ganesh  sales
3   1004      anil  sales

       0         1   dept
0   1001    nagesh  sales
1   1002  lakshami  sales
2  10303    ganesh  sales
3   1004      anil  sales